//* при натискані на кнопку створити візит зявляється модальне вікно для заповнення інформації про візит, коли вибираємо саме який доктор нам потрібен зявляються ще поля для заповнення інформації
//? створити метод в Modal який відкриває модальне вікно для заповнення інформації про візит а в цьому класі відслідковувати який доктор був вибраний ( створити switch case в якому при виборі конкретоного доктора викликається його під Клас в якому вже додаються поля ) також треба родумати логіку при завантажені сторінки має створюватись картки з однаковою інформацією а при натиску на них має зявитись повна інформація про візит

//* тобто в кожному підкласі візиту має бути свій рендер та при завантажені сторінки також викликати рендер відповідного класу ( потрібно буде якось відслідковувати який доктор був вибраний і викликати рендер відповідного класу )

//? також кожен підклас Візиту має мати змогу взаємодіяти з класом Request в якому створяться відповідні методи
